const HairColorLists = {
    spring: [
        ["ピンク", [255, 182, 193]],
        ["ライトゴールド", [255, 248, 220]],
        ["アプリコット", [255, 160, 122]],
        ["ライトブラウン", [139, 69, 19]],
        ["ミルクティー", [210, 180, 140]]
    ],
    summer: [
        ["パステルピンク", [255, 192, 203]],
        ["シルバー", [192, 192, 192]],
        ["アッシュベージュ", [222, 184, 135]],
        ["パールグレージュ", [232, 232, 250]],
        ["ラベンダー", [230, 230, 250]]
    ],
    autumn: [
        ["オリーブ", [128, 128, 0]],
        ["キャラメル", [210, 105, 30]],
        ["マロン", [139, 69, 19]],
        ["アンバー", [255, 191, 0]],
        ["ブロンズ", [205, 127, 50]]
    ],
    winter: [
        ["ディープブラック", [0, 0, 0]],
        ["ブルーブラック", [0, 0, 139]],
        ["シルバーブラック", [105, 105, 105]],
        ["ワインレッド", [139, 0, 0]],
        ["ダークチョコレート", [92, 64, 51]]
    ]
};

const LipColorLists = {
    spring: [
        ["コーラルピンク", [80, 127, 255]],
        ["ポピーレッド", [52, 66, 227]],
        ["アプリコットベージュ", [185, 218, 255]],
    ],
    summer: [
        ["ローズピンク", [180, 105, 255]],
        ["チェリーピンク", [119, 43, 219]],
        ["ラズベリー", [92, 11, 227]],
    ],
    autumn: [
        ["テラコッタ", [92, 78, 204]],
        ["サーモンピンク", [114, 128, 250]],
        ["ブラウンレッド", [42, 42, 165]],
    ],
    winter: [
        ["トゥルーレッド", [0, 0, 255]],
        ["バーガンディ", [32, 0, 128]],
        ["フューシャピンク", [255, 0, 255]],
    ]
};